renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_usb_basic/src/driver/r_usb_plibusbip.c
    if ((USB_NULL != pipe_no) && (USB_TRUE != g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].use_flag))
    {
        /* Endpoint number set */
        pipe_cfg    |= (uint16_t)(descriptor[USB_EP_B_ENDPOINTADDRESS] & USB_EP_NUMMASK);

        /* set max packet size */
        pipe_maxp   =  (uint16_t)descriptor[USB_EP_B_MAXPACKETSIZE_L];
        pipe_maxp   |= ((uint16_t)descriptor[USB_EP_B_MAXPACKETSIZE_H] << 8);

        /* Set Pipe table block */
        g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].use_flag  = USB_TRUE;
        g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_cfg  = pipe_cfg;
        g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_maxp = pipe_maxp;
        g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_peri = USB_NULL;
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
  #if USB_CFG_USE_USBIP == USB_CFG_IP1
        pipe_buf = usb_cstd_get_pipe_buf_value(pipe_no);
        g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_buf  = pipe_buf;
  #endif /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
    }
    else
    {
        pipe_no = USB_NULL;    /* Error */
    }
    return (pipe_no);
} /* eof usb_pstd_set_pipe_table() */

/******************************************************************************
Function Name   : usb_pstd_clr_pipe_table
Description     : Clear pipe table.
Arguments       : none
Return value    : none
******************************************************************************/
void usb_pstd_clr_pipe_table (void)
{
    uint8_t pipe_no;

    /* Search use pipe block */
    /* WAIT_LOOP */
    for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO +1); pipe_no++)
    {   /* Check use block */
        if (USB_TRUE == g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].use_flag)
        {   /* Clear use block */
            g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].use_flag = USB_FALSE;
            g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_cfg = USB_NULL;
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
  #if USB_CFG_USE_USBIP == USB_CFG_IP1
            g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_buf = USB_NULL;
  #endif /* USB_CFG_USE_USBIP == USB_CFG_IP1 */
#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
            g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_maxp = USB_NULL;
            g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].pipe_peri = USB_NULL;
        }
    }

} /* eof usb_pstd_clr_pipe_table() */

/******************************************************************************
Function Name   : usb_pstd_set_pipe_reg
Description     : Set USB Pipe registers. (Use Pipe All)
Arguments       : none
Return value    : none
******************************************************************************/
void usb_pstd_set_pipe_reg (void)
{
    uint8_t pipe_no;

    uint16_t buf;

    /* Search use pipe block */
    /* WAIT_LOOP */
    for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO +1); pipe_no++)
    {   /* Check use block */
        if (USB_TRUE == g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].use_flag)
        {
            /* Current FIFO port Clear */
            buf = hw_usb_read_fifosel (USB_NULL, USB_CUSE);
            if ((buf & USB_CURPIPE) == pipe_no)
            {
                usb_cstd_chg_curpipe(USB_NULL, (uint16_t) USB_PIPE0, (uint16_t) USB_CUSE, USB_FALSE);
            }
            buf = hw_usb_read_fifosel (USB_NULL, USB_D0USE);
            if ((buf & USB_CURPIPE) == pipe_no)
            {
                usb_cstd_chg_curpipe(USB_NULL, (uint16_t) USB_PIPE0, (uint16_t) USB_D0USE, USB_FALSE);
            }
            buf = hw_usb_read_fifosel (USB_NULL, USB_D1USE);
            if ((buf & USB_CURPIPE) == pipe_no)
            {
                usb_cstd_chg_curpipe (USB_NULL, (uint16_t) USB_PIPE0, (uint16_t) USB_D1USE, USB_FALSE);
            }

            /* Initialization of registers associated with specified pipe. */
            usb_cstd_pipe_init (USB_NULL, pipe_no);
        }
    }
} /* eof usb_pstd_set_pipe_reg() */

/******************************************************************************
Function Name   : usb_pstd_clr_pipe_reg
Description     : Clear Pipe registers. (Use Pipe All)
Arguments       : none
Return value    : none
******************************************************************************/
void usb_pstd_clr_pipe_reg (void)
{
    uint8_t pipe_no;

    /* Search use pipe block */
    /* WAIT_LOOP */
    for (pipe_no = USB_MIN_PIPE_NO; pipe_no < (USB_MAX_PIPE_NO +1); pipe_no++)
    {   /* Check use block */
        if (USB_TRUE == g_usb_pipe_table[USB_CFG_USE_USBIP][pipe_no].use_flag)
        {   /* Clear specified pipe configuration register. */
            usb_cstd_clr_pipe_cnfg(USB_NULL, pipe_no);
        }
    }
} /* eof usb_pstd_clr_pipe_reg() */

/******************************************************************************
Function Name   : usb_pstd_get_pipe_no
Description     : Get empty PIPE resource
Arguments       : uint8_t  type      : Transfer Type.(USB_EP_BULK/USB_EP_INT)
                : uint8_t  dir       : (USB_PIPE_DIR_IN/USB_PIPE_DIR_OUT)
Return value    : Pipe no (USB_PIPE1->USB_PIPE9:OK, USB_NULL:Error)
******************************************************************************/
uint8_t         usb_pstd_get_pipe_no (uint8_t type, uint8_t dir)
{
    uint8_t     pipe_no = USB_NULL;
#if defined(USB_CFG_PVND_USE)
    uint16_t    pipe;
#endif /* defined(USB_CFG_PVND_USE) */

#if defined(USB_CFG_PCDC_USE)
    if (USB_EP_BULK == type)
    {
        if (USB_PIPE_DIR_IN == dir)
        {
            pipe_no     = USB_CFG_PCDC_BULK_IN;
        }
        else
        {
            pipe_no     = USB_CFG_PCDC_BULK_OUT;
        }
    }

    if (USB_EP_INT == type)
    {
        if (USB_PIPE_DIR_IN == dir)
        {
            pipe_no     = USB_CFG_PCDC_INT_IN;
        }
    }
#endif /* defined(USB_CFG_PCDC_USE) */

#if defined(USB_CFG_PHID_USE)
    if (USB_EP_INT == type)
    {
        if (USB_PIPE_DIR_IN == dir)
        {
            pipe_no     = USB_CFG_PHID_INT_IN;
        }
        else
        {
            pipe_no     = USB_CFG_PHID_INT_OUT;
        }
    }
#endif /* defined(USB_CFG_PHID_USE) */

#if defined(USB_CFG_PMSC_USE)
    if (USB_EP_BULK == type)
    {
        if (USB_PIPE_DIR_IN == dir)
        {
            pipe_no     = USB_CFG_PMSC_BULK_IN;
        }
        else
        {
            pipe_no     = USB_CFG_PMSC_BULK_OUT;
        }
    }
#endif /* defined(USB_CFG_PMSC_USE) */

#if defined(USB_CFG_PVND_USE)
    if (USB_EP_BULK == type)
    {   /* BULK PIPE Loop */
        /* WAIT_LOOP */
        for (pipe = USB_BULK_PIPE_START; pipe < (USB_BULK_PIPE_END +1); pipe++)
        {   /* Check Free pipe */
            if (USB_FALSE == g_usb_pipe_table[USB_CFG_USE_USBIP][pipe].use_flag)
            {
                pipe_no = pipe; /* Set Free pipe */
                break;
            }
        }
    }

    if (USB_EP_INT == type)
    {   /* Interrupt PIPE Loop */
        /* WAIT_LOOP */
        for (pipe = USB_INT_PIPE_START; pipe < (USB_INT_PIPE_END +1); pipe++)
        {   /* Check Free pipe */
            if (USB_FALSE == g_usb_pipe_table[USB_CFG_USE_USBIP][pipe].use_flag)
            {
                pipe_no = pipe; /* Set Free pipe */
                break;
            }
        }
    }

#endif /* defined(USB_CFG_PVND_USE) */

    return pipe_no;
}

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI */

/******************************************************************************
 End  Of File
 ******************************************************************************/
